// 1--створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу

// const numArray = [73,75,93,99,6];
// console.log(numArray);
//
// const strArray = ['Iryna','Yurii','Anna','Nikita','Tymur'];
// console.log(strArray);
//
// const allArray = ['Iryna','Hakimon',47,true,NaN];
// console.log(allArray);

// 2-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let emptyArray = [];
// emptyArray[0] = 'Anja';
// emptyArray[1] = 'Nikita';
// emptyArray[2] = 'Tymur';
// emptyArray[3] = 3;
// emptyArray[4] = true;
// console.log(emptyArray);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i<10; i++) {
//     document.write('<div> Ukraine above all! </div>');
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (let i = 0; i < 10; i ++) {
//     document.write(`<div> ${i} Ukraine above all! </div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let counter = 0;
// while (counter < 20) {
//     document.write('<h1> lorem ipsum </h1>');
//     counter++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let counter = 0;
// while (counter < 20) {
//     document.write(`<h1> lorem ipsum ${counter} </h1>`);
//     counter++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// const array = [67, 1, 2, 43, 10, 5, 6, 236, 8, 9];
// for (let xxx of array) {
//     console.log(xxx);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// const array = ['prima', 'Simona', 'Kleopatra', 'Platon', 'Ramzes', 'Dragon', 'Bonnie', 'don', 'sfinx', 'cats'];
// for (let xxx of array) {
//     console.log(xxx);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// const array = ['Simona', NaN, 'Kleopatra', 'Platon', 'Ramzes', 'Dragon', 3, 'Bonnie', 6, true];
// let counter = 0;
// while (counter < array.length) {
//     console.log(counter, array[counter]);
//     counter++;
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки булеві елементи

// const array = ['Simona', true, 'Kleopatra', 'Platon', 'Ramzes', 'Dragon', 3, 'Bonnie', 6, false];
// for (let xxx of array)
// if (typeof xxx === "boolean") {
//     console.log(xxx);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки числові елементи

// const array = ['Simona', true, 'Kleopatra', 'Platon', 'Ramzes', 'Dragon', 3, 'Bonnie', 6, false];
// for (let xxx of array)
// if (typeof xxx === 'number') {
//     console.log(xxx);
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу.
// За допомогою if та typeof вивести тільки рядкові елементи

// const array = ['Simona', true, 'Kleopatra', 'Platon', 'Ramzes', 'Dragon', 3, 'Bonnie', 6, false];
// for (let xxx of array)
// if (typeof xxx === 'string') {
//     console.log(xxx);
//  }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.

// const emptyArr = [];
// emptyArr[0] = 28;
// emptyArr[1] = true;
// emptyArr[2] = '31';
// emptyArr[3] = 295;
// emptyArr[4] = 'Ann';
// emptyArr[5] = 'Georg';
// emptyArr[6] = 'Tymur';
// emptyArr[7] = {name: 'Iren', age: 47};
// emptyArr[8] = 'Nick';
// emptyArr[9] = NaN
// for (let i=0; i<emptyArr.length; i++) {
//     console.log(emptyArr[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i++) {
//     console.log('step : ', i);
//     document.write(`<div> step : ${i} </div>`)
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i++) {
//     console.log('step : ', i);
//     document.write(`<div> step : ${i} </div>`)
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//
// for (let i = 0; i < 200; i = i + 2) {
//     console.log('step : ', i);
//     document.write(`<div> step : ${i} </div>`)
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//
// for (let i = 2; i < 100; i++)
//     if (i % 2 === 0){
//         console.log('step : ', i);
//     document.write(`<div> step : ${i} </div>`)
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 1; i < 100; i = i+2) {
//         console.log('step : ', i);
//         document.write(`<div> step : ${i} </div>`)
// }


// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let word = ['a', 'b', 'c'];
// word.push(1);
// word.push(2);
// word.push(3);
// console.log(word);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let nums = [1, 2, 3];
// nums.length = 0;
// nums[0] = 3;
// nums[1] = 2;
// nums[2] = 1;
// console.log(nums);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let nums = [1, 2, 3];
// nums.push(4);
// nums.push(5);
// nums.push(6);
// console.log(nums);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let nums = [1, 2, 3];
// nums.unshift(6);
// nums.unshift(5);
// nums.unshift(4);
// console.log(nums);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let array = ['js', 'css', 'jq'];
// let element = array.shift();
// console.log(element);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let array = ['js', 'css', 'jq'];
// let element = array.pop();
// console.log(element);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.


// 1
//  створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//  2. вывести на консоль  каждый третий елемент
//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.